<template>
    <div style="height: 580px">
        <el-steps :active="0" simple>
            <el-step title="小额贷款" icon="el-icon-bank-card"></el-step>
            <el-step title="填写资料" icon="el-icon-edit"></el-step>
            <el-step title="急速放款" icon="el-icon-star-on"></el-step>
        </el-steps>
        <div style="margin-top: 30px;text-align: center">
            <p style="color: rgba(180,173,163,0.85)">可借</p>
            <p style="font-size: 70px">￥{{smadaimsg.kejie}}</p>
            <p style="color: rgba(180,173,163,0.85)">当前额度：￥{{smadaimsg.zonged}}<span style="margin-left: 10px">日利率：{{smadaimsg.lilv}}%</span></p>
        </div>
        <div style="margin-top: 20px;text-align: center">
            <p><el-checkbox v-model="checked"></el-checkbox>&nbsp;
                <el-tooltip class="item" effect="dark" content="点击阅读" placement="right">
                    <el-button type="text" @click="centerDialogVisible = true">已同意《贷款协议》</el-button>
                </el-tooltip>
                <el-dialog
                        title="《贷款条约》"
                        :visible.sync="centerDialogVisible"
                        width="60%"
                        center>
                    <span>
                        法律声明及隐私政策
                        <textarea style="width: 100%;height: 300px" readonly="readonly" wrap="physical">
                            重要提示:

本《法律声明及隐私政策》（下称“本声明”）适用于招联消费金融有限公司（以下简称招联或我司）向您提供的所有产品和服务。在使用招联产品/服务前，请您务必认真阅读本声明，如对本声明内容有任何疑问，请您及时提请我司予以说明或向相关专业人士咨询。

阅读本声明的过程中，如果您不同意本声明或其中任何内容，您应立即停止使用招联产品/服务。一旦您使用招联提供的任一产品/服务的，您的使用行为将被视为对本声明全部内容的认可。


一、法律声明

（一）知识产权声明

除非招联另有声明，招联互联网平台（包括但不限于招联PC端及移动终端等，以下简称招联平台）内的所有产品、技术、软件、程序、数据及其他信息（包括但不限于文字、图像、图片、照片、音频、视频、图表、色彩、版面设计、电子文档）的所有权利（包括但不限于版权、商标权、专利权、商业秘密及其他所有相关权利）均归招联所有。未经招联书面许可，任何人不得擅自使用（包括但不限于通过任何程序或设备监视、复制、传播、展示、镜像、上传、下载招联平台内的任何内容）。

未经招联书面授权，招联的商标、LOGO、商号、企业名称、网址、企业标识等，任何人不得以任何方式展示、使用或作其他处理，也不得向他人表明您有权展示、使用或作其他处理。


（二）免责声明

鉴于招联平台向合作商家提供了电子商务平台服务功能，合作商家在招联平台上发布的商家信息、商品/服务信息（包括但不限于商家名称、联系人及联络信息、商品/服务的描述和说明、相关图片、视频等）均由合作商家提供并在招联平台向您展示，由合作商家对其提供的所有信息的真实性、合法性、准确性及完整性承担责任，与招联无关。

招联与您之间的消费信贷关系完全独立于您与合作商家之间的商品/服务销售基础合同关系，该基础合同关系的无效或变更并不影响招联与您之间的消费信贷关系的法律效力。您不得以您与合作商家之间的任何纠纷为由拒绝履行消费信贷关系项下的任何义务。


（三）权利声明

招联高度重视知识产权保护并遵守各项知识产权法律、法规和具有约束力的规范性文件，反对侵权盗版行为。权利人认为招联平台上的内容（包括但不限于招联合作商家发布的商品信息）可能涉嫌侵犯其合法权益，应向招联发出书面通知，招联收到后将及时处理。


二、隐私政策


招联非常注重保护用户个人信息和个人隐私，在您使用招联平台提供的产品和服务时，招联将按照本隐私政策收集、使用、共享及保护您的个人信息。因此请您完整地阅读本隐私政策，以帮助您了解如何维护您的隐私权。如果您不同意本隐私政策的任何内容，您应立即停止使用招联平台提供的任何产品/服务。当您使用招联平台提供的任一产品/服务时，即表示您已同意招联按照本隐私权政策来合法收集、使用和保护您的个人信息。


（一）适用范围

本隐私政策适用于招联平台提供的所有产品和服务，您访问招联平台使用招联提供的产品/服务，均适用本隐私政策。

请注意：本隐私政策不适用于其他第三方向您提供的服务，若您想了解第三方的隐私政策，请您与该等第三方直接取得联系以获得关于它们隐私政策的详细情况。例如，招联平台上的合作商家依托招联平台向您提供商品/服务时，您向该商家提供的个人信息不适用于本隐私政策。


（二）信息收集

为了向您提供更好、更优、更个性化的服务，我们将根据您使用的产品/服务收集您的如下信息：

1.您向招联提供的信息

当您在招联平台注册账户时，请您根据招联的要求及时、详尽及准确地提供个人资料，并在你的个人信息变更时及时更新注册资料。如果因注册信息不真实而引起的问题，由您自行承担相应的后果。请您不要将您的帐号、密码转让或出借予他人使用。如您发现您的帐号遭他人非法使用，应立即通知招联。互联网上不排除因黑客行为或用户的保管疏忽导致帐号、密码遭他人非法使用，此类情况与招联无关。

您在使用招联平台产品/服务时，需要根据产品/服务的内容，选择填写及/或提交产品/服务所必须的信息，可能包括但不限于您的姓名、性别、出生年月日、身份证号码、电话号码、电子邮箱、地址、银行卡信息、第三方支付账户信息、公积金信息及相关附加信息（如您所在的省份和城市、邮政编码等）。如果因您提供的信息不真实而引起的问题，由您自行承担相应的后果。如果您不使用某些产品/服务，您可以选择不提供该产品/服务相关的某一或某些信息，但是这样可能使您无法使用招联的许多特色产品/服务。

招联还会记录您在使用招联产品/服务时提供的其他信息。例如您与招联客服联系时提供的相关信息、您参与问卷调查时向我们发送的问卷答复信息以及您与招联合作伙伴之间互动时招联获得的相关信息等。

2.在您使用招联产品/服务过程中收集的信息

为了提高产品/服务质量和用户体验，招联会留存您使用招联产品/服务以及使用方式的相关信息，这类信息包括：

（1）您的浏览器和计算机上的信息。在您访问招联平台或使用招联产品/服务时，招联系统自动接收并记录的您的浏览器和计算机上的信息（包括但不限于您的IP地址、浏览器的类型、使用的语言、访问日期和时间、软硬件特征信息及您需求的网页记录等数据）。

（2）您的位置信息。当您下载或使用招联及合作伙伴开发的应用程序，或访问移动网页使用招联产品/服务时，招联可能会读取您的位置。大多数移动设备将允许您关闭定位服务，如果您需要关闭定位服务的，请您咨询向您的移动设备的服务商或生产商了解相关情况。

（3）您的设备信息。招联可能会读取您访问招联平台或使用招联产品/服务时所使用的终端设备的信息，包括但不限于设备型号、设备识别码、操作系统、分辨率、电信运营商等。

（4）您的行为或交易信息。招联可能会记录您访问招联平台或使用招联产品/服务时所进行的操作以及您在招联平台上进行交易的相关信息。

同时，为提高您使用招联提供的产品/服务的安全性，更准确地预防钓鱼网站欺诈和木马病毒，招联可能会通过了解一些您的网络使用习惯、您常用的软件信息等手段来判断您账户的风险，并可能会记录一些招联认为有风险的链接（“URL”）。

3.来自第三方的信息

（1）在您注册招联账户和使用招联产品/服务过程中，您授权招联可向中国人民银行金融信用信息基础数据库及其他有关机构或单位（包括但不限于经国务院或其他政府有权部门批准合法设立的其他征信机构、公安、公积金、社保、税务、民政、物流、通信运营商、电子商务平台、中国互联网金融协会、互联网平台等第三方机构）查询、收集您的相关信息。这些信息包括但不限于您的征信信息、财产信息、关系人、资信状况、就业情况、收入情况、婚姻情况、学历信息、地址信息、位置数据、通讯行为、通讯信息、互联网使用信息、互联网使用行为等信息。

（2）在您注册招联账户和使用招联产品/服务过程中，您授权招联可向招联的关联方、合作伙伴获取其所收集的与您相关信息。这些信息包括但不限于您的身份信息、行为信息、交易信息、设备信息等，招联会将此类信息汇总，用于帮助招联向您提供更好、更个性化的服务以及更好地预防互联网欺诈。

（3）当您通过招联合作伙伴的网络平台使用招联产品/服务时，您授权招联可向招联的合作伙伴获取其所收集的与您相关信息。这些信息包括但不限于您的身份信息、行为信息、交易信息、设备信息等。

（4）当您与使用招联服务的招联合作伙伴之间互动时，为共同向您提供服务及改进服务质量的合理需要，我们将从合作伙伴处接收关于您的体验或您与其互动的信息。


（三）信息管理、使用

收集您的信息是为了向您提供产品/服务及提升产品/服务质量，为了实现这一目的，招联会把您的信息用于下列用途：

1.向您提供您使用的各项产品/服务，并维护、改进这些产品/服务。

2.向您推荐您可能感兴趣的内容，包括但不限于向您发出产品/服务信息，或通过系统向您展示个性化的第三方推广信息，或在征得您同意的情况下与招联的合作伙伴共享信息以便他们向您发送有关其产品和服务的信息。如您不希望接收上述信息，可通过相应的退订功能进行退订。

3.用于验证您的身份以及用于预防、发现、调查欺诈、危害安全、违法或违反与招联的协议、政策或规则的行为，以保护您、招联或其他第三方的合法权益。

4.招联可能会将根据某项产品/服务收集的个人信息与来自其他产品/服务所获得的信息结合起来，用于为您提供更加个性化的服务使用。

5.招联会对招联的产品/服务使用情况进行统计，并可能会与公众或第三方分享这些统计信息，以展示招联的产品或服务的整体使用趋势。但这些统计信息不包含您的任何身份识别信息。

6.经您同意或授权的其他用途。


（四）信息共享

招联对您的信息承担保密义务，不会向第三方出售您的个人隐私信息。除下列情形外，招联不会与任何其他第三方共享您的个人信息：

1. 不受招联控制的合作商家。合作商家在招联平台作为卖家向您销售商品/服务时，招联会与该合作商家分享与交易有关的客户信息。

2. 第三方服务提供者。招联可能会聘请其他公司、组织或个人代表招联履行某些职能，包括但不限于发送信函、电子邮件或短信、提供市场营销帮助、提供搜索结果和链接（包括付费搜索名单和链接）、数据分析、处理以及逾期贷款催收等。他们能够接触到为履行其职责所需的客户信息，但不能将此信息用于任何其他目的。

3. 业务转让。为健康、持续发展招联的业务，招联可能会出售部分业务，例如，招联可能会转让部分贷款项下债权。在这些交易中，客户信息通常是所转让业务资产中的一部分，与该等业务一并转让给受让方，但这些信息仍然受制于转让前已有的任何隐私声明所作出的承诺，但客户作出其他同意的除外。

4. 业务合作。当您通过招联合作伙伴的渠道接受招联提供的产品/服务，为顺利地向您提供金融服务及增值服务（包括但不限于借款账单展示、查询）之必要，您同意招联可以将您的个人信息、金融信息提供给招联的合作伙伴。招联承诺将严格要求合作伙伴对您的个人资料承担保密义务。

5.出于法律原因。为遵守相关法律法规或者行政机关、监管机构等政府有权部门依法提出的要求以及、出于诉讼/仲裁目的，我们可能有必要披露您的个人信息。如果我们确定您出现违反适用的法律法规或招联规则或相关协议的情况，或为保护招联及其关联公司或其他用户或公众的权利、财产或安全免遭损害，我们也可能披露关于您的信息，包括相关违法/违规行为以及招联已对您采取的措施。

6. 协助解决争议。某些情况下只有共享您的信息，才能处理您与他人的纠纷或争议。例如您是适格的知识产权投诉人并已提起投诉，我们可能应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；您在招联平台上与合作商家产生的某一交易中，如交易任何一方履行或部分履行了交易义务并提出信息披露请求的，招联会视情况向该方提供其交易对方的联络方式等必要信息，以促成纠纷的解决。

7. 根据您与招联签署的相关服务条款或协议规定共享您的信息。

8.事先获得您的同意或授权。除以上规定以外，在获得您的同意或授权后，招联可以与其他公司、组织和个人分享您的个人信息。


（五）用户对信息的自主管理

招联提供了便捷的方法，让您可以查询、修改及删除您的账户信息等使用招联产品/服务时您提供的个人信息。如果您对如何查询、修改及删除您的个人信息有疑问的，请您及时向招联咨询。

如果您认为招联存在违反法律、行政法规的规定或者与您的约定收集、使用您个人信息的，您可以通过招联客服与我们取得联系。


（六）用户对信息的自主共享

当您通过招联的产品/服务创建交流、交易或分享时，您可以自主选择沟通、交易或分享的对象，作为能够看到您的交易内容、联络方式、交流信息或分享内容等相关信息的第三方。

当您在招联平台购买第三方合作商家的商品/服务时，您不可避免地要向交易对方或潜在的交易对方披露自己的个人信息，如联络方式或者邮政地址。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息泄密，尤其是您的账户或密码发生泄露，请您立即联络招联客服，以便招联采取相应措施。

当您在招联合作伙伴的网络平台以招联的消费贷款购买招联合作伙伴自营或其合作商家销售的商品/服务时，您不可避免地要向交易对方或潜在的交易对方披露自己的个人信息，如联络方式或者邮政地址。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息泄密，尤其是您在招联合作伙伴网络平台的账户或密码发生泄露，请您立即联络招联合作伙伴采取相应措施；如该等泄露影响到了您与招联之间的消费信贷关系的，请您及时通知招联。

请注意，您在使用招联产品/服务时自愿共享的信息，可能会涉及您或他人的个人信息甚至个人敏感信息。请您更加谨慎地考虑，是否在使用招联的产品/服务时共享甚至公开分享相关信息。


（七）信息的存留

招联收集的有关您的信息和资料将保存在招联及（或）其关联公司、合作伙伴的服务器上，这些信息和资料可能传送至您所在国家、地区或招联收集信息和资料所在地并在该地被访问、存储和展示。

我们将在实现本隐私政策中所述目的所必需的期间内保留你的个人信息，除非法律要求或允许在更长的期间内保留这些信息。


（八）信息的保护

招联非常重视您的个人信息安全。我们努力采取各种合理的技术和管理方面的安全措施来保护您的个人信息，并尽最大合理努力使您的个人信息不会被泄漏、毁损或者丢失，包括但不限于SSL、信息加密存储、数据中心的访问控制。我们对可能接触到您个人信息的员工或外包人员也采取了严格管理，包括但不限于与接触个人信息的人员签署保密协议、采取信息访问权限控制、监控并记录该等人员的操作情况等措施。

招联账户信息（包括账号及密码）为非常重要的个人信息，请您妥善设置、保管您的招联账号及密码。招联将通过备份、对密码等关键信息进行加密等安全措施以保护您的账户信息等个人信息不丢失、不被滥用和变造。尽管有前述安全措施，但同时也请您理解互联网上不排除因不可抗力因素（如黑客行为、自然灾害等）或用户的保管疏忽导致帐号、密码遭他人非法使用，此类情况与招联无关。

请注意，单独的设备信息、搜索关键词信息等是无法与任何特定个人直接建立联系的数据，不属于个人信息。如果我们将这类非个人信息与其他信息结合用于识别自然人个人身份，或者将其与个人信息结合使用，则在结合使用期间，此类设备信息将被视为个人信息。

（九）Cookie和其他技术的应用

您访问招联平台时，我们可能会通过采用各种技术收集和存储相关信息，以了解您的使用习惯，帮您省去重复输入注册信息的步骤，或者帮助判断您的账户安全。这些数据文件可能是Cookie、Flash Cookie，或您的浏览器或关联应用程序提供的其他本地存储（以下统称“Cookie”）。大部分浏览器的工具条中的帮助部分有关于如何关闭Cookie的方法。此外，您可以通过改变浏览器附加程序（browser add-ons）的设置，或通过访问其制造商的网页，来关闭或删除浏览器附加程序使用的类似数据。不过，Cookie能让您充分利用招联平台便利的服务， 拒绝招联的Cookie在某些情况下可能会影响您安全访问招联平台和使用招联平台提供的产品/服务，因此招联建议您将其设置为打开状态。

招联平台的网页上可能会包含一些电子图象（即“网络 beacon”），使用网络beacon可以帮助招联计算浏览网页的用户或访问某些cookie，招联可能会通过网络beacon收集您浏览网页活动信息，例如您访问的页面地址、您先前访问的援引页面的地址、您停留在页面的时间、您的浏览环境以及显示设定等。


《法律声明及隐私政策》的修订

招联可不定期修改本《法律声明及隐私政策》，变更后的《法律声明及隐私权政策》将在修订生效前通过招联平台公告或以其他适当方式通知您。该等情况下，若您继续使用招联的产品/服务，即表示同意受经修订的《法律声明及隐私政策》的约束。
                        </textarea>
                    </span>
                    <span slot="footer" class="dialog-footer">
                 <el-button type="primary" @click="centerDialogVisible = false">确 定</el-button>
                    </span>
                </el-dialog>
            </p>
            <el-button style="width: 15%;margin-top: 10px" type="primary"
                       round
                       :disabled="!checked"
                       @click="tosmallDai_children()"
            >立即借款</el-button>
            <p>
                <el-link type="primary">贷款记录</el-link>
                <span style="color: #409EFF">&nbsp;&nbsp;|&nbsp;&nbsp;</span>
                <el-link type="primary">提前还款</el-link>
            </p>
        </div>
    </div>
</template>

<script>
    export default {
        name: "SmallDai",
        data() {
            return {
                checked: false,
                centerDialogVisible:false,
                smadaimsg:{
                    zonged:'',
                    kejie:'',
                    yinhuan:'',
                    lilv:''
                },
            };
        },

        methods:{
            tosmallDai_children(){
                this.axios({
                    url:"http://localhost:10086/refresh",
                    method:"POST",
                    withCredentials:true
                }).then(res=>{
                    if(res.data.status==1){
                        this.$router.push({path: '/smallDai_children', query: {'lilv':this.smadaimsg.lilv}});
                    }else {
                        this.$confirm('当前借款不可用，请保持良好的信用，如有疑问，请联系客服！', '提示', {
                            confirmButtonText: '联系客服',
                            cancelButtonText: '取消',
                            type: 'warning'
                        }).then(() => {
                            this.$router.push({path: '/about', query: {}});
                        }).catch(() => {
                            this.$message({
                                type: 'info',
                                message: '取消操作'
                            });
                        });
                    }
                })
            },
            toMoney(num){
                num = num.toLocaleString();
                if(num.toString().indexOf('.')==-1){
                    num=num+".00";
                }
                if(num.toString().split('.')[1].length==1){
                    num=num+"0";
                }
                return num;//返回的是字符串23,245.12保留2位小数
            },
            smadaiinfo(){
                console.log("发起请求获得小额贷款信息：")
                this.axios({url:'http://localhost:10086/smalldai_home',method:"post",withCredentials:true}).then(res=>{
                    console.log("返回数据："+res.data)
                    this.smadaimsg.kejie = this.toMoney(res.data.newedu);
                    this.smadaimsg.zonged =this.toMoney(res.data.user.smalldai);
                    this.smadaimsg.yinhuan=this.toMoney(res.data.onehuan);
                    this.smadaimsg.lilv=this.toMoney(res.data.lilv.lilv)
                });
            }
        },
        created(){
            this.smadaiinfo();
        },
    }
</script>

<style scoped>

</style>
