<template>
    <div style="height: 1300px;width: 100%;border: red solid 0px">
        <div style="width:100%;height:78px;border: red solid 0px;background:#F8F8FF;">
            <el-breadcrumb separator="/"style="height: 100%;">
                <br><br>
                <el-breadcrumb-item :to="{ path: '/Home' }" style="height: 100%;font-size: 170%">首页</el-breadcrumb-item>
                <el-breadcrumb-item :to="{ path: '/news' }" style="height: 100%;font-size: 170%">每日新闻</el-breadcrumb-item>
                <el-breadcrumb-item style="height: 100%;font-size: 170%" >新闻详情</el-breadcrumb-item>
            </el-breadcrumb>
        </div>
        <div style="width: 80%;margin: 0 auto;border: red solid 0px">

            <span style="font-size: 200%;font-weight: 800">以科技助普惠 招联金融五年精进的四条路径</span>
            <br>
           2020-01-01 <span style="margin-left: 30px">新华社</span>
            <hr>
            <div style="line-height: 32px">
                &nbsp; 与时代的脚步同行，这是一种幸运。2015年3月18日，招联金融信心满满地出发，以“微金融、新互联”为发展理念，以纯线上的业务模式，开启了一条有别于传统消费金融公司的新型发展道路。<br>
                &nbsp; 同年12月31日，《推进普惠金融发展规划(2016—2020年)》正式发布，遵循市场规律发展普惠金融、以适当的成本为适合的人群提供适度的普惠服务，成为支持实体经济在金融供给侧的重要改革方向。<br>
                &nbsp; 如何把普惠金融做得恰到好处?招联金融的回答是：以科技金融的高度切入，开创纯线上、轻资产的运营模式。招联金融董事总经理章杨清认为，成本适当、客群适合、服务适度，是普惠金融发展至关重要的三大问题，“精准识别、精确匹配、精细运营、精致体验”是四条具体的实现路径。为此，招联金融近年来不断加大在科技研发等领域投入和产出应用，持续开展让利客户活动。<br>
                &nbsp; 在金融科技推动下，招联金融近年来在同行业线下展业模式遭遇瓶颈时，实现了加速超越。公开数据显示，截至2019年底，招联金融实现营业收入约107.4亿元，同比增长54%，实现净利润约14.66亿元，同比增长17%，主要业务指标延续了稳健增长态势，稳居持牌同业第一梯队。招联金融成立五周年以来的实践证明，科技让普惠金融更加行之有效。先进的数字化手段，能够将更适当的成本、更个性的服务，精准抵达低收入人群、小微企业主等普惠人群，充分发挥普惠金融服务“毛细血管”的作用。<br>
                &nbsp; 精准识别：“聪明”地读懂客户需求<br>
                &nbsp; 回到五年前，当时消费金融市场一方面是传统金融机构未充分覆盖的长尾客户群体，另一方面是庞大的客户需求，二者的鸿沟是中国征信体系覆盖不足。成立之初，招联金融克服几乎没有任何消费金融场景和客户资源等不利因素，从传统金融机构覆盖不到、普罗大众急需的小微金融服务入手，创新打造了纯线上、轻运营的互联网消费金融经营模式。<br>
                &nbsp; 章杨清介绍，招联金融从建立之初，就选择了纯线上业务模式，以大数据等先进技术手段驱动，对不同客群实施精细化管理，辅助特色活动与客户触达，逐步连接客户、探索客户、深入认知客户，逐渐形成了客户全生命周期管理、客户额度管理、客户分级定价经营的专业化运营能力。<br>
                &nbsp; 而招联金融能够“聪明”地读懂客户需求，精准识别客群风险，还依托于公司不断发挥金融科技优势，在多元化征信上持续探索和应用，帮助丰富普惠客群风险画像，为后续匹配精准服务奠定基础。<br>
                &nbsp; 其中，基于金融科技力量，招联金融在业内首创“沃信用分”。这是首例面向运营商全网客户的信用评分体系。该案例主要是与中国联通合作，利用数据挖掘、数据建模等大数据技术，对消费者的多元化信息进行多维度、分类交叉处理，形成更丰富的用户画像和个人信用，打造了一套KS值超过40的“沃信用分”价值评分体系。沃信用分可根据客户信用的综合评估，通过预授信的模式，为客户提供金融特权，直接应用到联通后付费的现金分期、手机分期、话费充值等业务场景中。该项目是国内消费金融公司的首创，体现了互联网经济和大数据时代下的征信新模式。<br>
                &nbsp; 精确匹配：“优”“惠”金融服务的基础<br>
                &nbsp; 章杨清表示，在提供消费金融服务时，给普惠客群精准匹配产品服务显然尤为必要。反之，“不该贷、过度贷”等问题泛滥，则造成普惠资源的低效使用、无效浪费，产生更多社会成本，违背普惠金融初衷。<br>
                &nbsp; 他介绍，招联金融持续深化大数据技术的应用，深度挖掘数据价值，完善数据驱动决策能力，实现了实时客户风险定价和响应度模型评估，形成行业低定价能力，最终转化的是更“优”“惠”的消费金融服务。<br>
                &nbsp; 2020年受新冠肺炎疫情影响，经济遭受负面冲击，低收入和小微客群对普惠金融服务的依赖度正在提高。中国普惠金融研究院发布的一份报告显示，从调研全国范围内一部分工薪阶层和微型经济体来看，这部分人群现金储备非常少，应急能力薄弱，但大多数人没有债务违约记录，非常需要贷款展期政策和服务。<br>
                &nbsp; “在有限的普惠资源内，如何更高效地服务显然是社会所关心的问题。这对精准匹配产品服务提出了更高要求，也影响到普惠金融服务是否能够长久、持续。”章杨清说。
                <br>(文/杨昭)
            </div>
            <br><br><br>
            <hr>
        </div>
    </div>
</template>

<script>
    export default {
        name: "newsInfo"
    }
</script>

<style scoped>

</style>